In [1]:
import pandas as pd

# Viewing Data  
(`.head()`, `.tail()`, `.sample()`, `.info()`, `.describe()`)

lets setup a sample DataFrame

In [2]:
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Rohit", "Neha", "Vishal"],
    "Age": [21, 25, 23, 29, 20, 26],
    "City": ["Pune", "Mumbai", "Nashik", "Pune", "Mumbai", "Nagpur"],
    "Salary": [50000, 65000, 55000, 70000, 48000, 62000]
})

df

     Name  Age    City  Salary
0   Onkar   21    Pune   50000
1    Amit   25  Mumbai   65000
2    Sara   23  Nashik   55000
3   Rohit   29    Pune   70000
4    Neha   20  Mumbai   48000
5  Vishal   26  Nagpur   62000

## 1. `.head()` -> First few rows  
Defalt 5 rows but we can randomly give number

In [5]:
df.head()

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000
2   Sara   23  Nashik   55000
3  Rohit   29    Pune   70000
4   Neha   20  Mumbai   48000

In [7]:
df.head(2) # First 2 rows

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000

## 2. `.tail()` -> Last few rows  
Default 5 rows but in this also we can give random number

In [8]:
df.tail()

     Name  Age    City  Salary
1    Amit   25  Mumbai   65000
2    Sara   23  Nashik   55000
3   Rohit   29    Pune   70000
4    Neha   20  Mumbai   48000
5  Vishal   26  Nagpur   62000

In [9]:
df.tail(2) # Last 2 rows

     Name  Age    City  Salary
4    Neha   20  Mumbai   48000
5  Vishal   26  Nagpur   62000

## 3. `.sample()` -> Random rows  
Default only 1 but we can give random number also

In [12]:
df.sample()

   Name  Age    City  Salary
4  Neha   20  Mumbai   48000

In [13]:
df.sample(2) # Gives 2 random rows

   Name  Age    City  Salary
4  Neha   20  Mumbai   48000
2  Sara   23  Nashik   55000

## 4. `.info()` -> Quick summary  
It shows column names, datatypes, notnull values, memory usages, etc  
It is very usefull before cleaning the data

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Salary  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

## 5. `.describe()` -> States summary (numerical columns only)  
It shows mean, std (standard deviation), min/max, etc

In [15]:
df.describe()

            Age        Salary
count   6.00000      6.000000
mean   24.00000  58333.333333
std     3.34664   8733.078877
min    20.00000  48000.000000
25%    21.50000  51250.000000
50%    24.00000  58500.000000
75%    25.75000  64250.000000
max    29.00000  70000.000000

For all columns we need to pass `include="all"`  
For objects there are some extra contents like unique, top, freq

In [16]:
df.describe(include="all")

         Name       Age  City        Salary
count       6   6.00000     6      6.000000
unique      6       NaN     4           NaN
top     Onkar       NaN  Pune           NaN
freq        1       NaN     2           NaN
mean      NaN  24.00000   NaN  58333.333333
std       NaN   3.34664   NaN   8733.078877
min       NaN  20.00000   NaN  48000.000000
25%       NaN  21.50000   NaN  51250.000000
50%       NaN  24.00000   NaN  58500.000000
75%       NaN  25.75000   NaN  64250.000000
max       NaN  29.00000   NaN  70000.000000

# Practice  
1. Create a DataFrame with 6–7 rows (your choice).  
2. Display:
   - first 3 rows
   - last 2 rows
   - 2 random rows
3. Use df.info() — how many non-null entries are there?
4. Use df.describe() — what is the mean of one numeric column?

In [25]:
pdf = pd.DataFrame({
    "Name": ["Aaa", "Bbb", "Ccc", "Ddd", "Eee", "Fff"],
    "Age": [21, 25, 23, 29, 20, 26],
    "City": ["Pune", "Mumbai", "Nashik", "Pune", "Mumbai", "Nagpur"],
    "Salary": [50000, 65000, 55000, 70000, 48000, 62000],
    "Bank_Balance": [10000, 20000, 30000, 40000, 50000, 60000]
})
pdf

  Name  Age    City  Salary  Bank_Balance
0  Aaa   21    Pune   50000         10000
1  Bbb   25  Mumbai   65000         20000
2  Ccc   23  Nashik   55000         30000
3  Ddd   29    Pune   70000         40000
4  Eee   20  Mumbai   48000         50000
5  Fff   26  Nagpur   62000         60000

In [26]:
pdf.head(3)

  Name  Age    City  Salary  Bank_Balance
0  Aaa   21    Pune   50000         10000
1  Bbb   25  Mumbai   65000         20000
2  Ccc   23  Nashik   55000         30000

In [27]:
pdf.tail(2)

  Name  Age    City  Salary  Bank_Balance
4  Eee   20  Mumbai   48000         50000
5  Fff   26  Nagpur   62000         60000

In [28]:
pdf.sample(2)

  Name  Age    City  Salary  Bank_Balance
2  Ccc   23  Nashik   55000         30000
1  Bbb   25  Mumbai   65000         20000

In [29]:
pdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6 non-null      object
 1   Age           6 non-null      int64
 2   City          6 non-null      object
 3   Salary        6 non-null      int64
 4   Bank_Balance  6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

In [30]:
pdf.describe()

            Age        Salary  Bank_Balance
count   6.00000      6.000000      6.000000
mean   24.00000  58333.333333  35000.000000
std     3.34664   8733.078877  18708.286934
min    20.00000  48000.000000  10000.000000
25%    21.50000  51250.000000  22500.000000
50%    24.00000  58500.000000  35000.000000
75%    25.75000  64250.000000  47500.000000
max    29.00000  70000.000000  60000.000000